Tekla Open API Reference for Tekla Structures 2025
RebarLapping.LapSideEnum Enumeration
 The side of the split that the lap is located.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum LapSideEnum
Public Enumeration LapSideEnum
Members
Member name | Value | Description
LAP_LEFT | 0 |  Lap left.
LAP_RIGHT | 1 |  Lap right.
LAP_MIDDLE | 2 |  Lap middle.
See Also
Reference
Tekla.Structures.Model Namespace